import pandas as pd
from itertools import product

list1 = ["무교동", "다동", "태평로1가", "을지로1가", "을지로2가", "남대문로1가", "삼각동", "수하동", "장교동", "수표동", "소공동", "남창동", "북창동", "태평로2가", "남대문로2가", "남대문로3가", "남대문로4가", "남대문로5가", "봉래동1가", "봉래동2가", "회현동1가", "회현동2가", "회현동3가", "충무로1가", "충무로2가", "명동1가", "명동2가", "남산동1가", "남산동2가", "남산동3가", "저동1가", "충무로4가", "충무로5가", "인현동2가", "예관동", "묵정동", "필동1가", "필동2가", "필동3가", "남학동", "주자동", "예장동", "장충동1가", "장충동2가", "광희동1가", "광희동2가", "쌍림동", "을지로6가", "을지로7가", "을지로4가", "을지로5가", "주교동", "방산동", "오장동", "을지로3가", "입정동", "산림동", "충무로3가", "초동", "인현동1가", "저동2가", "신당동", "흥인동", "무학동", "황학동", "서소문동", "정동", "순화동", "의주로1가", "충정로1가", "중림동", "의주로2가", "만리동1가", "만리동2가", "회현동", "명동", "필동", "장충동", "광희동", "을지로동", "다산동", "약수동", "청구동", "신당5동", "동화동"]

list2 = ["변기막힘", "변기뚫는업체", "변기수리", "싱크대막힘", "하수구막힘", "변기뚫음"]


# 모든 조합 생성
all_combinations = list(product(list1, list2))

# 3개씩 묶어서 새로운 조합 생성
chunk_size = 2
result_combinations = [', '.join(f'{combo[0]}{combo[1]}' for combo in all_combinations[i:i+chunk_size]) for i in range(0, len(all_combinations), chunk_size)]

# 데이터 생성
data = {'Keyword': result_combinations}

# 데이터프레임 생성
df = pd.DataFrame(data)

# 데이터프레임을 엑셀 파일로 저장
excel_file = '하수구_중구.xlsx'
df.to_excel(excel_file, index=False, engine='openpyxl')

print(f'키워드 조합이 {excel_file} 파일로 저장되었습니다.')